In [1]:
import pandas as pd

In [15]:
df=pd.read_csv("home_prices.csv")
df.head()

     city  area    price
0  mumbai   400  4500000
1  mumbai   500  6000000
2  mumbai   250  3000000
3    pune   250  2000000
4  mumbai   350  4200000

In [16]:
dummies=pd.get_dummies(df.city)
dummies.head()

   mumbai  nagpur  pune
0       1       0     0
1       1       0     0
2       1       0     0
3       0       0     1
4       1       0     0

In [4]:
df=df.join(dummies)
df.head()

     city  area    price  mumbai  nagpur  pune
0  mumbai   400  4500000       1       0     0
1  mumbai   500  6000000       1       0     0
2  mumbai   250  3000000       1       0     0
3    pune   250  2000000       0       0     1
4  mumbai   350  4200000       1       0     0

In [5]:
from sklearn.linear_model import LinearRegression

In [6]:
model=LinearRegression()

In [8]:
model.fit(df[["area","mumbai","pune","nagpur"]],df.price)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [18]:
model.predict([[450,1,0,0]])

array([5097810.2189781])

In [19]:
#y=m1x1+ (m2x2) + ....+(mnxn) + b

In [20]:
import pickle

In [22]:
with open("myfile","wb") as f:
    pickle.dump(model,f)

In [23]:
import joblib

In [25]:
joblib.dump(model,"myfile2")

['myfile2']